openfoam/case-08-24-25/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (-700 0 0);

boundaryField
{
    open
    {
        type            supersonicFreestream;
        pInf            $pressure;
        TInf            $temperature;
        UInf            $flowVelocity;
        gamma           1.4;
        value           $internalField;
    }

    inlet
    {
        type            supersonicFreestream;
        pInf            $pressure;
        TInf            $temperature;
        UInf            $flowVelocity;
        gamma           1.4;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $flowVelocity;
        value           $internalField;
    }

    bullet
    {
        type            noSlip;
    }

    defaultFaces
    {
        type            noSlip;
    }
}

// ************************************************************************* //
