openfoam/case-08-24-25/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    open
    {
        type        waveTransmissive;
        field       p;
        psi         thermo:psi;
        gamma       1.4;
        fieldInf    101325;
        lInf        1;
        value       $internalField;
    }

    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        $pressure;
        lInf            1;
        value           $internalField;
    }

    bullet
    {
        type        zeroGradient;
    }

    defaultFaces
    {
        type        zeroGradient;
    }
}

// ************************************************************************* //
