openfoam/case-08-24-25/0/e
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      e;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];  // J/kg
internalField   uniform 213922.625;

boundaryField
{
    open
    {
        type        inletOutlet;
        inletValue  uniform 213922.625;   // Cv*TInf
        value       $internalField;
    }

    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type        zeroGradient;
    }

    bullet
    {
        type        zeroGradient;
    }

    defaultFaces
    {
        type        zeroGradient;
    }
}